#### 11기 머신러닝 수업목차에 나오는 교육영상과 책을 미리 읽어오면 더 이해가 잘되니까 틈나는대로 보고 그 단원을 완성하는 것은 코드로 관련 머신러닝 알고리즘을 구현하면 완성

## ■ R
### 뉴질랜드 aukland 대학의 Rebert Gentleman과 Ross Ihaka가 1995년에 개발한 소프트웨어
### 데이터 분석을 위한 통계 및 그래픽스를 지원하는 무료 소프트웨어

## ■ 작업 디렉토리 설정 및 emp.csv 로드하는 방법

In [2]:
setwd("d:/R")

In [3]:
getwd()

[1] "d:/R"

In [4]:
emp<-read.csv('emp3.csv',header=T)
emp

   index empno ename  job       mgr  hiredate        sal  comm deptno
1   1    7839  KING   PRESIDENT   NA 1981-11-17 0:00 5000   NA 10
2   2    7698  BLAKE  MANAGER   7839 1981-05-01 0:00 2850   NA 30
3   3    7782  CLARK  MANAGER   7839 1981-05-09 0:00 2450   NA 10
4   4    7566  JONES  MANAGER   7839 1981-04-01 0:00 2975   NA 20
5   5    7654  MARTIN SALESMAN  7698 1981-09-10 0:00 1250 1400 30
6   6    7499  ALLEN  SALESMAN  7698 1981-02-11 0:00 1600  300 30
7   7    7844  TURNER SALESMAN  7698 1981-08-21 0:00 1500    0 30
8   8    7900  JAMES  CLERK     7698 1981-12-11 0:00  950   NA 30
9   9    7521  WARD   SALESMAN  7698 1981-02-23 0:00 1250  500 30
10 10    7902  FORD   ANALYST   7566 1981-12-11 0:00 3000   NA 20
11 11    7369  SMITH  CLERK     7902 1980-12-09 0:00  800   NA 20
12 12    7788  SCOTT  ANALYST   7566 1982-12-22 0:00 3000   NA 20
13 13    7876  ADAMS  CLERK     7788 1983-01-15 0:00 1100   NA 20
14 14    7934  MILLER CLERK     7782 1982-01-11 0:00 1300   NA 10

## ■ SQL과 R의 차이
### 아주 긴 SQL 코드를 R 코드로는 아주 단순하게 작성할 수 있다.
```sql
select deptno, sum(decode(job,'SALESMAN',sal,0)),
               sum(decode(job,'ANALYST',sal,0)),
               sum(decode(job,'CLERK',sal,0)),
               sum(decode(job,'MANAGER',sal,0)),
               sum(decode(job,'PRESIDENT',sal,0))
    from emp
    group by deptno;
```

In [5]:
attach(emp)
tapply(sal,list(deptno,job),sum)

   ANALYST CLERK MANAGER PRESIDENT SALESMAN
10   NA    1300  2450    5000        NA
20 6000    1900  2975      NA        NA
30   NA     950  2850      NA      5600

※ attach(emp)를 안하면 다음과 같이 작성해야한다.  
```R
tapply(emp$sal,list(emp$deptno, emp$job),sum)
```

### SQL로는 시각화를 할 수 없지만 R은 데이터 시각화가 아주 강력하다

## ■ R의 자료구조 (R에서 데이터를 저장하는 구조)
### 1. vector
####       같은 데이터 타입을 갖는 1차원 배열구조
### 2. matrix
####       같은 데이터 타입을 갖는 2차원 배열구조
### 3. array
####       같은 데이터 타입을 갖는 다차원 배열구조
### 4. data.frame
####       같은 데이터 타입을 갖는 컬럼으로 이루어진 2차원 배열구조(RDBMS의 table과 유사)
### 5. list
####       서로 다른 데이터 구조(vector, matrix, array, data frame)인 데이터 타입이 중첩된 구조

![구조](r자료구조.png)

```
      Oracle          vs          R
     desc emp                  str(emp)
```

In [6]:
str(emp)

'data.frame':	14 obs. of  9 variables:
 $ index   : int  1 2 3 4 5 6 7 8 9 10 ...
 $ empno   : int  7839 7698 7782 7566 7654 7499 7844 7900 7521 7902 ...
 $ ename   : Factor w/ 14 levels "ADAMS","ALLEN",..: 8 3 4 7 9 2 13 6 14 5 ...
 $ job     : Factor w/ 5 levels "ANALYST","CLERK",..: 4 3 3 3 5 5 5 2 5 1 ...
 $ mgr     : int  NA 7839 7839 7839 7698 7698 7698 7698 7698 7566 ...
 $ hiredate: Factor w/ 13 levels "1980-12-09 0:00",..: 9 5 6 4 8 2 7 10 3 10 ...
 $ sal     : int  5000 2850 2450 2975 1250 1600 1500 950 1250 3000 ...
 $ comm    : int  NA NA NA NA 1400 300 0 NA 500 NA ...
 $ deptno  : int  10 30 10 20 30 30 30 30 30 20 ...

## ■ R에서의 기본 데이터 검색

### ※ 문제1. emp 데이터 프레임에서 이름과 월급을 출력하시오

In [9]:
emp[,c('ename','sal')] # c() : combine

   ename  sal
1  KING   5000
2  BLAKE  2850
3  CLARK  2450
4  JONES  2975
5  MARTIN 1250
6  ALLEN  1600
7  TURNER 1500
8  JAMES   950
9  WARD   1250
10 FORD   3000
11 SMITH   800
12 SCOTT  3000
13 ADAMS  1100
14 MILLER 1300

### ※ 문제2. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오

In [24]:
emp=read.csv('emp3.csv',header=T)
emp[emp$sal>=3000,c('ename','sal')]

   ename sal
1  KING  5000
10 FORD  3000
12 SCOTT 3000

### ※ 문제3. 월급이 2000 이상인 사원들의 이름과 월급을 출력하시오

In [25]:
emp[emp$sal>=2000,c('ename','sal')]

   ename sal
1  KING  5000
2  BLAKE 2850
3  CLARK 2450
4  JONES 2975
10 FORD  3000
12 SCOTT 3000

### ※ R에서 사용하는 연산자 3가지
#### 1. 산술연산자  : +, _, *, /
#### 2. 비교연산자 : >, <, >=, <=, ==, !=
#### 3. 논리연산자 : & (벡터화 됐을 때 연산) / &&(벡터화 되지 않았을 때 연산) / | (벡터화 됐을 때 연산)/ || (벡터화 되지 않았을 때 연산)/ ! (not)

## ■ 벡터화 된 연산 vs 벡터화 되지 않은 연산

In [62]:
# 벡터화 된 연산
x=c(1,2,3)
print(x)
print(x > c(1,1,1) & x < c(3,3,3))

[1] 1 2 3
[1] FALSE  TRUE FALSE

In [60]:
# 벡터화 되지 않은 연산
x2=1
print(x2 > -2 && x2 < 2)

[1] TRUE

### ※ 문제4. 직업이 SALESMAN인 사원들의 이름과 월급과 직업을 출력하시오

In [41]:
emp[emp$job=='SALESMAN',c('ename','sal','job')]

  ename  sal  job
5 MARTIN 1250 SALESMAN
6 ALLEN  1600 SALESMAN
7 TURNER 1500 SALESMAN
9 WARD   1250 SALESMAN

### ※ 문제5. 직업이 SALESMAN이고 월급이 1000 이상인 사원들의 이름과 월급과 직업을 출력하시오

In [42]:
emp[emp$job=='SALESMAN' & emp$sal>=1000, c('ename','sal','job')]

  ename  sal  job
5 MARTIN 1250 SALESMAN
6 ALLEN  1600 SALESMAN
7 TURNER 1500 SALESMAN
9 WARD   1250 SALESMAN

#### ※ emp\\$job이나 emp\$sal은 벡터이다. 벡터란 같은 데이터 타입을 갖는 1차원 구조이다

## ■ 연결 연산자
```
        Oracle    vs    R
          ||          paste
          ```

### ※ 문제6. 아래와 같이 결과를 출력하시오
```sql
select ename||'의 직업은'|| job
    from emp;
    ```

In [47]:
paste(emp$ename,'의 직업은',emp$job)

 [1] "KING 의 직업은 PRESIDENT"  "BLAKE 의 직업은 MANAGER"
 [3] "CLARK 의 직업은 MANAGER"   "JONES 의 직업은 MANAGER"
 [5] "MARTIN 의 직업은 SALESMAN" "ALLEN 의 직업은 SALESMAN"
 [7] "TURNER 의 직업은 SALESMAN" "JAMES 의 직업은 CLERK"
 [9] "WARD 의 직업은 SALESMAN"   "FORD 의 직업은 ANALYST"
[11] "SMITH 의 직업은 CLERK"     "SCOTT 의 직업은 ANALYST"
[13] "ADAMS 의 직업은 CLERK"     "MILLER 의 직업은 CLERK"

In [48]:
install.packages("data.table")

Installing package into 'C:/Users/knitwill/Documents/R/win-library/3.6'
(as 'lib' is unspecified)

package 'data.table' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\knitwill\AppData\Local\Temp\RtmpWwdHCw\downloaded_packages

In [50]:
data.table(paste(emp$ename,'의 직업은',emp$job))

   V1
1  KING 의 직업은 PRESIDENT
2  BLAKE 의 직업은 MANAGER
3  CLARK 의 직업은 MANAGER
4  JONES 의 직업은 MANAGER
5  MARTIN 의 직업은 SALESMAN
6  ALLEN 의 직업은 SALESMAN
7  TURNER 의 직업은 SALESMAN
8  JAMES 의 직업은 CLERK
9  WARD 의 직업은 SALESMAN
10 FORD 의 직업은 ANALYST
11 SMITH 의 직업은 CLERK
12 SCOTT 의 직업은 ANALYST
13 ADAMS 의 직업은 CLERK
14 MILLER 의 직업은 CLERK

## ■ 기타 비교 연산자
```
    SQL        vs           R
    in                     %in%
    like                   grep
    is null                is.na
    between .. and         >= & <=
    ```

### ※ 문제7. 직업이 SALESMAN, ANALYST인 사원들의 이름, 월급, 직업을 출력하시오

In [51]:
emp[emp$job %in% c('SALESMAN','ANALYST'),c('ename','sal','job')]

   ename  sal  job
5  MARTIN 1250 SALESMAN
6  ALLEN  1600 SALESMAN
7  TURNER 1500 SALESMAN
9  WARD   1250 SALESMAN
10 FORD   3000 ANALYST
12 SCOTT  3000 ANALYST

### ※ 문제8. 직업이 SALESMAN, ANALYST가 아닌 사원들의 이름, 월급, 직업을 출력하시오

In [55]:
emp[!emp$job %in% c('SALESMAN','ANALYST'),c('ename','sal','job')]

   ename  sal  job
1  KING   5000 PRESIDENT
2  BLAKE  2850 MANAGER
3  CLARK  2450 MANAGER
4  JONES  2975 MANAGER
8  JAMES   950 CLERK
11 SMITH   800 CLERK
13 ADAMS  1100 CLERK
14 MILLER 1300 CLERK

### ※ 문제9. 커미션이 null인 사원들의 이름, 월급, 커미션을 출력하시오

In [58]:
emp[is.na(emp$comm),c('ename','sal','comm')]

   ename  sal  comm
1  KING   5000 NA
2  BLAKE  2850 NA
3  CLARK  2450 NA
4  JONES  2975 NA
8  JAMES   950 NA
10 FORD   3000 NA
11 SMITH   800 NA
12 SCOTT  3000 NA
13 ADAMS  1100 NA
14 MILLER 1300 NA

### ※ 문제10. 커미션이 null이 아닌 사원들의 이름, 월급, 커미션을 출력하시오

In [59]:
emp[!is.na(emp$comm),c('ename','sal','comm')]

  ename  sal  comm
5 MARTIN 1250 1400
6 ALLEN  1600  300
7 TURNER 1500    0
9 WARD   1250  500

### ※ 문제11. 이름의 첫번째 철자가 A로 시작하는 사원들의 이름, 월급을 출력

    정규식 표현>
    ^ 첫번째
    $ 마지막
    . 한자리수
    * 여러개(wild card)

In [63]:
emp[grep("^A",emp$ename),c('ename','sal')]

   ename sal
6  ALLEN 1600
13 ADAMS 1100

### ※ 문제12. 이름의 끝글자가 T로 끝나는 사원들의 이름을 출력

In [70]:
print(emp[grep("T$",emp$ename),'ename'])

[1] SCOTT
14 Levels: ADAMS ALLEN BLAKE CLARK FORD JAMES JONES KING MARTIN ... WARD

### ※ 문제13. 이름의 두번째 철자가 M인 사원들의 이름, 월급을 출력

In [79]:
emp[grep('^.M',emp$ename),c('ename','sal')]

   ename sal
11 SMITH 800

### ※ 문제14. 이름의 세번째 철자가 L인 사원들의 이름, 월급을 출력

In [80]:
emp[grep('^..L',emp$ename),c('ename','sal')]

   ename  sal
6  ALLEN  1600
14 MILLER 1300

## ■ 중복제거
```
    SQL           vs           R
  distinct                   unique
  ```

### ※ 문제15. 부서번호를 출력하는데 중복을 제거해서 출력하시오

In [86]:
print(data.frame("부서번호"=unique(emp$deptno)))

  부서번호
1       10
2       30
3       20

## ■ 정렬작업
```
      SQL         vs          R
    order by                data frame의 order 옵션
                            doBy 패키지 -> orderBy 함수
                            ```

In [87]:
install.packages("doBy")

Installing package into 'C:/Users/knitwill/Documents/R/win-library/3.6'
(as 'lib' is unspecified)
also installing the dependencies 'minqa', 'nloptr', 'statmod', 'RcppEigen', 'lme4', 'pbkrtest', 'Deriv'

package 'minqa' successfully unpacked and MD5 sums checked
package 'nloptr' successfully unpacked and MD5 sums checked
package 'statmod' successfully unpacked and MD5 sums checked
package 'RcppEigen' successfully unpacked and MD5 sums checked
package 'lme4' successfully unpacked and MD5 sums checked
package 'pbkrtest' successfully unpacked and MD5 sums checked
package 'Deriv' successfully unpacked and MD5 sums checked
package 'doBy' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\knitwill\AppData\Local\Temp\RtmpWwdHCw\downloaded_packages

### ※ 문제16. 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오

In [89]:
emp[order(emp$sal, decreasing = T),c('ename','sal')]

   ename  sal
1  KING   5000
10 FORD   3000
12 SCOTT  3000
4  JONES  2975
2  BLAKE  2850
3  CLARK  2450
6  ALLEN  1600
7  TURNER 1500
14 MILLER 1300
5  MARTIN 1250
9  WARD   1250
13 ADAMS  1100
8  JAMES   950
11 SMITH   800

### ※ 문제17. 직업이 SALESMAN인 사원들의 이름, 월급, 직업을 출력하는데 월급이 높은 사원부터 출력

In [96]:
rs=emp[emp$job=='SALESMAN',c('ename','sal','job')]
rs[order(rs$sal,decreasing = T),]

  ename  sal  job
6 ALLEN  1600 SALESMAN
7 TURNER 1500 SALESMAN
5 MARTIN 1250 SALESMAN
9 WARD   1250 SALESMAN

R에서 모든 변수들을 다 보고싶을 때 ls()

In [97]:
ls()

 [1] "addr"         "date4"        "df1"          "df2"          "df3"
 [6] "df4"          "df5"          "df7"          "df8"          "dff"
[11] "emp"          "height"       "hobby"        "i"            "iter"
[16] "mem2"         "mem3"         "member"       "name"         "new"
[21] "no"           "pal1"         "price"        "prob"         "qty"
[26] "rs"           "sales"        "sales2"       "sum"          "tel"
[31] "v1"           "v2"           "v3"           "v4"           "v5"
[36] "v6"           "v7"           "v8"           "var_dic_list" "vec1"
[41] "vec2"         "vec3"         "x"            "x2"           "y"

x, x2 변수를 지우고 싶다면?

In [100]:
rm(x, x2)

Warning message in rm(x, x2):
"객체 'x'를 찾을 수 없습니다"

In [101]:
ls()

 [1] "addr"         "date4"        "df1"          "df2"          "df3"
 [6] "df4"          "df5"          "df7"          "df8"          "dff"
[11] "emp"          "height"       "hobby"        "i"            "iter"
[16] "mem2"         "mem3"         "member"       "name"         "new"
[21] "no"           "pal1"         "price"        "prob"         "qty"
[26] "rs"           "sales"        "sales2"       "sum"          "tel"
[31] "v1"           "v2"           "v3"           "v4"           "v5"
[36] "v6"           "v7"           "v8"           "var_dic_list" "vec1"
[41] "vec2"         "vec3"         "y"

### ※ 문제18. (점심시간 문제) 부서번호가 20번인 사원들의 이름과 월급과 부서번호를 출력하는데 월급이 높은 사원부터 출력

In [103]:
rs=emp[emp$deptno==20,c('ename','sal','deptno')]
rs[order(rs$sal, decreasing = T),]

   ename sal  deptno
10 FORD  3000 20
12 SCOTT 3000 20
4  JONES 2975 20
13 ADAMS 1100 20
11 SMITH  800 20

### ※ 문제19. 위의 문제를 doBy 패키지를 이용해서 수행하시오

In [2]:
library(doBy)

Warning message:
"package 'doBy' was built under R version 3.6.3"

In [3]:
orderBy(~-sal,emp[emp$deptno==20,c('ename','sal')]) # 내림차순
orderBy(~sal,emp[emp$deptno==20,c('ename','sal')]) # 오름차순

   ename sal
10 FORD  3000
12 SCOTT 3000
4  JONES 2975
13 ADAMS 1100
11 SMITH  800

   ename sal
11 SMITH  800
13 ADAMS 1100
4  JONES 2975
10 FORD  3000
12 SCOTT 3000

### ※ 문제20. crime_loc.csv를 워킹 디렉토리에 내려받고 R로 로드해서 결과를 출력하는데 살인이 일어나는 장소와 건수를 출력하는데 건수가 높은 것 부터 출력하시오

In [4]:
c_loc=read.csv('crime_loc.csv',header=T)
c_loc

    범죄           장소         건수
1   절도           아파트       25389
2   절도           집           37787
3   절도           고속도로       151
4   절도           노상         62560
5   절도           상점         29977
6   절도           시장노점      1239
7   절도           숙박업소      9203
8   절도           병원         16053
9   절도           사무실        8416
10  절도           공장          3540
11  절도           공사장        4003
12  절도           창고          2329
13  절도           역대합실       881
14  절도           지하철         737
15  절도           교통          2249
16  절도           유흥접객업소   631
17  절도           유원지        1532
18  절도           학교          3203
19  절도           금융기관      5888
20  절도           의료기관      2719
21  절도           종교기관      2293
22  절도           산야          2393
23  절도           해상            50
24  절도           부대            81
25  절도           구금장소         4
26  절도           공지           366
27  절도           기타         44333
28  장물           아파트          88
29  장물           집             130
30  장물           고속도로         1
... ...            ...          ...
592 교통사고처리   구금장소         0
593 교통사고처리   공지             4
594 교통사고처리   기타          1123
595 도로교통법위반 아파트          65
596 도로교통법위반 집              15
597 도로교통법위반 고속도로       211
598 도로교통법위반 노상         42824
599 도로교통법위반 상점            25
600 도로교통법위반 시장노점         6
601 도로교통법위반 숙박업소         2
602 도로교통법위반 병원             2
603 도로교통법위반 사무실          76
604 도로교통법위반 공장             0
605 도로교통법위반 공사장           7
606 도로교통법위반 창고             0
607 도로교통법위반 역대합실         2
608 도로교통법위반 지하철           0
609 도로교통법위반 교통            14
610 도로교통법위반 유흥접객업소     0
611 도로교통법위반 유원지          21
612 도로교통법위반 학교             5
613 도로교통법위반 금융기관         2
614 도로교통법위반 의료기관         4
615 도로교통법위반 종교기관         0
616 도로교통법위반 산야             1
617 도로교통법위반 해상             0
618 도로교통법위반 부대             0
619 도로교통법위반 구금장소         0
620 도로교통법위반 공지             3
621 도로교통법위반 기타           704

In [6]:
rs=c_loc[c_loc$범죄=='살인',]
orderBy(~-건수,rs)

    범죄 장소         건수
83  살인 집           312
85  살인 노상         280
82  살인 아파트       242
108 살인 기타         131
89  살인 병원          87
88  살인 숙박업소      43
90  살인 사무실        40
86  살인 상점          23
101 살인 의료기관      19
91  살인 공장          15
98  살인 유원지        13
96  살인 교통           9
94  살인 역대합실       8
99  살인 학교           8
103 살인 산야           8
87  살인 시장노점       5
92  살인 공사장         4
93  살인 창고           4
107 살인 공지           3
102 살인 종교기관       2
104 살인 해상           2
84  살인 고속도로       1
95  살인 지하철         1
97  살인 유흥접객업소   1
105 살인 부대           1
100 살인 금융기관       0
106 살인 구금장소       0

### ※ 문제21. c_loc에서 범죄유형을 출력하는데 중복을 제거해서 출력하시오

In [10]:
data.frame('범죄'=unique(c_loc$범죄))

   범죄
1  절도
2  장물
3  손괴
4  살인
5  강도
6  방화
7  강간
8  폭행
9  상해
10 협박
11 공갈
12 약취와유인
13 체포와감금
14 폭력행위등처벌에관한법률위반
15 간통
16 도박과복표
17 과실치사상
18 업무상과실치사상
19 실화
20 주거침입
21 유기
22 교통사고처리
23 도로교통법위반

## ■ SQL과 R 함수 비교
### 함수
#### 1. 문자함수
#### 2. 숫자함수
#### 3. 날짜함수
#### 4. 변환함수
#### 5. 일반함수

#### ■ 문자함수
```
    SQL     vs        R
    upper          toupper
    lower          tolower
    substr         substr
    replace        gsub
    ```

### ※ 문제22.이름과 직업을 출력하는데 소문자로 출력하시오

In [18]:
# cbind(tolower(emp$ename),tolower(emp$job))
data.frame(이름=tolower(emp$ename),직업=tolower(emp$job))

   이름   직업
1  king   president
2  blake  manager
3  clark  manager
4  jones  manager
5  martin salesman
6  allen  salesman
7  turner salesman
8  james  clerk
9  ward   salesman
10 ford   analyst
11 smith  clerk
12 scott  analyst
13 adams  clerk
14 miller clerk

##### ■ substr 함수

### ※ 문제23. 이름의 두번째 철자가 M인 사원들의 이름과 월급을 출력하는데 substr을 이용해서 수행하시오
```sql
select ename, sal
    from emp
    where substr(ename,2,1)='M';
    ```

In [21]:
emp[substr(emp$ename,2,2)=='M',c('ename','sal')]

   ename sal
11 SMITH 800

### ※ 문제24. SMITH의 이름을 출력하는데 MIT만 출력하시오

In [29]:
print(substr(emp[emp$ename=='SMITH','ename'],2,4))

[1] "MIT"

##### ■ gsub 함수

     gsub('h','H',text) 
     특정 text에서 소문자 h를 대문자 H로 변경해라

### ※ 문제25. 이름과 월급을 출력하는데 월급을 출력할 때 숫자 0을 별표(*)로 출력하시오
```sql
select ename, replace(sal,0,'*')
    from emp;
    ```

In [35]:
data.frame(emp$ename,gsub(0,'*',emp$sal))

   emp.ename gsub.0.......emp.sal.
1  KING      5***
2  BLAKE     285*
3  CLARK     245*
4  JONES     2975
5  MARTIN    125*
6  ALLEN     16**
7  TURNER    15**
8  JAMES     95*
9  WARD      125*
10 FORD      3***
11 SMITH     8**
12 SCOTT     3***
13 ADAMS     11**
14 MILLER    13**

### ※ 문제26. 아래의 SQL을 R로 구현하시오
```sql
select ename, regexp_replace(sal,'[0-2]','*')
    from emp;
    ```

In [39]:
data.frame(이름=emp$ename, 월급=gsub('[0-2]','*',emp$sal))

   이름   월급
1  KING   5***
2  BLAKE  *85*
3  CLARK  *45*
4  JONES  *975
5  MARTIN **5*
6  ALLEN  *6**
7  TURNER *5**
8  JAMES  95*
9  WARD   **5*
10 FORD   3***
11 SMITH  8**
12 SCOTT  3***
13 ADAMS  ****
14 MILLER *3**

#### ■ 숫자함수
```
    SQL        vs        R
    round              round
    trunc              trunc
    mod                 %%
    power               ^
   ```

### ※ 문제27. 6의 9승을 출력하시오

In [40]:
6^9

[1] 10077696

### ※ 문제28. 10을 3으로 나눈 나머지값을 출력하시오

In [42]:
print(10 %% 3)

[1] 1

### ※ 문제29. 이름과 연봉을 출력하시오

In [48]:
orderBy(~-연봉, data.frame(이름=emp$ename, 연봉=emp$sal*12))

   이름   연봉
1  KING   60000
10 FORD   36000
12 SCOTT  36000
4  JONES  35700
2  BLAKE  34200
3  CLARK  29400
6  ALLEN  19200
7  TURNER 18000
14 MILLER 15600
5  MARTIN 15000
9  WARD   15000
13 ADAMS  13200
8  JAMES  11400
11 SMITH   9600

In [53]:
orderBy(~-연봉,data.frame(이름=emp$ename,연봉=round(emp$sal*12,-3)))

   이름   연봉
1  KING   60000
4  JONES  36000
10 FORD   36000
12 SCOTT  36000
2  BLAKE  34000
3  CLARK  29000
6  ALLEN  19000
7  TURNER 18000
14 MILLER 16000
5  MARTIN 15000
9  WARD   15000
13 ADAMS  13000
8  JAMES  11000
11 SMITH  10000

### ※ 문제30. 백단위 자리를 포함해서 다 잘라내고 0으로 출력되게 하시오

In [58]:
orderBy(~-연봉, data.frame(이름=emp$ename, 연봉=trunc(emp$sal*12)))

   이름   연봉
1  KING   60000
10 FORD   36000
12 SCOTT  36000
4  JONES  35700
2  BLAKE  34200
3  CLARK  29400
6  ALLEN  19200
7  TURNER 18000
14 MILLER 15600
5  MARTIN 15000
9  WARD   15000
13 ADAMS  13200
8  JAMES  11400
11 SMITH   9600

 int [1:14] 5000 2850 2450 2975 1250 1600 1500 950 1250 3000 ...

※ R에서 trunc 함수는 소숫점 이하만 버리고 정수부분은 버리지 않는다. round는 반올림이 어느 자리에서든 가능

#### ■ 날짜함수
```
    Oracle      vs       R
    sysdate           Sys.date()
    add_months()
    months_between     사용자 정의 함수
    last_day
    next_day
    ```

### ※ 문제31. 오늘 날짜를 출력하시오

In [60]:
Sys.Date()

[1] "2020-06-11"

### ※ 문제32. 이름, 입사한 날짜부터 오늘까지 총 몇일 근무했는지 출력하시오

In [64]:
data.frame(근무일=Sys.Date()-as.Date(emp$hiredate))

   근무일
1  14086 days
2  14286 days
3  14278 days
4  14316 days
5  14154 days
6  14365 days
7  14174 days
8  14062 days
9  14353 days
10 14062 days
11 14429 days
12 13686 days
13 13662 days
14 14031 days

### ※ 문제33. 오늘날짜의 달의 마지막 날짜를 출력하시오
```sql
select last_day(sysdate)
    from dual;
    ```

In [65]:
library(lubridate)

Warning message:
"package 'lubridate' was built under R version 3.6.3"
Attaching package: 'lubridate'

The following objects are masked from 'package:base':

    date, intersect, setdiff, union

In [67]:
print(ceiling_date(Sys.Date(),'month'))

[1] "2020-07-01"

In [68]:
print(floor_date(Sys.Date(),'month'))

[1] "2020-06-01"

In [69]:
print(ceiling_date(Sys.Date(),'month')-1)

[1] "2020-06-30"

#### ※ 함수 생성

In [73]:
last_day=function(x){
    ceiling_date(x,'months')-days(1)
}

In [75]:
print(last_day(Sys.Date()))

[1] "2020-06-30"